#include "parliament.h"
#include <iostream>

using namespace std;

int main() {
	Parliament p;
	p.workDay();

	system("pause");
	return 0;
}

/*

Використовуючи засоби ООП, змоделювати демократичну систему правління.
Система складається з виборців, які голосують за партії , що підтримують закони. Кожен виборець
підтримує певний список законів і протистоїть іншому списку законів. Кожна партія також підтримує
певний список законів і протистоїть іншому списку законів; прийшовши до влади, партія
намагається прийняти закони, які вона підтримує, і відхилити ті, яким вона протистоїть. Партії, які
прийшли до влади, утворюють парламент, де розглядаються закони. В кожен момент часу,
парламент може розглядати лише один закон. Кожен закон має складність, яка впливає на час
розгляду. Деякі з законів описують власне процес виборів (як часто вони проводяться, як проходить
голосування, які партії проходять до парламенту, скільки представників в парламенті від кожної
партії). Деякі закони описують процес роботи парламенту (як довго розглядають закони, скільки
потрібно голосів для прийняття чи відхилення). Існують також інші закони, які в даній моделі не
впливають на її функціонування, але є предметом підтримки виборців та партій. Виборці мають різні
стратегії голосування: хтось голосує за критеріями підтримки чи не підтримки своїх законів, хтось
голосує за партії, які зараз при владі чи не при владі, хтось голосує випадковим чином. Партії мають
різні стратегії розгляду законів: починають приймати підтримувані закони чи відхиляти
непідтримувані, починають з простіших чи складніших законів, вибирають закони випадковим
чином.
Створити модель системи з певною кількістю виборців, партій та законів, промоделювати її роботу
протягом певного часу.
Реалізувати алгоритм побудови списку законів, впорядкованих за наступними критеріями (у всіх
критеріях спершу більше): 1) кількість виборців, які їх підтримують; 2) кількість партій, які їх
підтримують; 3) кількість виборців, які їм протистоять; 4) кількість партій, які їм протистоять; 5)
кількість розглядів закону в парламенті. Будується спільне значення, що об’єднує ці критерії з
певними ваговими коефіцієнтами, і закони впорядковуються за цим значенням.

*/